Joghaimi/PMM/custom_Board/1.8.13/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# PMM0620 (Native USB Port)
# --------------------------------------
arduino_zero_native.name=PMM0620 (Native USB Port)
arduino_zero_native.vid.0=0x2341
arduino_zero_native.pid.0=0x804d
arduino_zero_native.vid.1=0x2341
arduino_zero_native.pid.1=0x004d
arduino_zero_native.vid.2=0x2341
arduino_zero_native.pid.2=0x824d
arduino_zero_native.vid.3=0x2341
arduino_zero_native.pid.3=0x024d
arduino_zero_native.upload_port.0.vid=0x2341
arduino_zero_native.upload_port.0.pid=0x804d
arduino_zero_native.upload_port.1.vid=0x2341
arduino_zero_native.upload_port.1.pid=0x004d
arduino_zero_native.upload_port.2.vid=0x2341
arduino_zero_native.upload_port.2.pid=0x824d
arduino_zero_native.upload_port.3.vid=0x2341
arduino_zero_native.upload_port.3.pid=0x024d
arduino_zero_native.upload_port.4.board=arduino_zero_native

arduino_zero_native.upload.tool=bossac
arduino_zero_native.upload.tool.default=bossac
arduino_zero_native.upload.tool.network=arduino_ota
arduino_zero_native.upload.protocol=sam-ba
arduino_zero_native.upload.maximum_size=262144
arduino_zero_native.upload.maximum_data_size=32768
arduino_zero_native.upload.use_1200bps_touch=true
arduino_zero_native.upload.wait_for_upload_port=true
arduino_zero_native.upload.native_usb=true
arduino_zero_native.build.mcu=cortex-m0plus
arduino_zero_native.build.f_cpu=48000000L
arduino_zero_native.build.usb_product="pmm0620"
arduino_zero_native.build.usb_manufacturer="PMM LLC"
arduino_zero_native.build.usb_product="PMM0620"
arduino_zero_native.build.board=pmm0620
arduino_zero_native.build.core=arduino
arduino_zero_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arduino_zero_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_native.build.variant=pmm0620
arduino_zero_native.build.variant_system_lib=
arduino_zero_native.build.vid=0x2341
arduino_zero_native.build.pid=0x804d
arduino_zero_native.bootloader.tool=openocd
arduino_zero_native.bootloader.tool.default=openocd
arduino_zero_native.bootloader.file=zero/samd21_sam_ba.bin



# PMM0625 (Native USB Port)
# --------------------------------------
PMM0625.name=PMM0625 (Native USB Port)
PMM0625.vid.0=0x2341
PMM0625.pid.0=0x804d
PMM0625.vid.1=0x2341
PMM0625.pid.1=0x004d
PMM0625.vid.2=0x2341
PMM0625.pid.2=0x824d
PMM0625.vid.3=0x2341
PMM0625.pid.3=0x024d
PMM0625.upload_port.0.vid=0x2341
PMM0625.upload_port.0.pid=0x804d
PMM0625.upload_port.1.vid=0x2341
PMM0625.upload_port.1.pid=0x004d
PMM0625.upload_port.2.vid=0x2341
PMM0625.upload_port.2.pid=0x824d
PMM0625.upload_port.3.vid=0x2341
PMM0625.upload_port.3.pid=0x024d
PMM0625.upload_port.4.board=arduino_zero_native
PMM0625.build.usb_product="PMM0620"
PMM0625.upload.tool=bossac
PMM0625.upload.tool.default=bossac
PMM0625.upload.tool.network=arduino_ota
PMM0625.upload.protocol=sam-ba
PMM0625.upload.maximum_size=262144
PMM0625.upload.maximum_data_size=32768
PMM0625.upload.use_1200bps_touch=true
PMM0625.upload.wait_for_upload_port=true
PMM0625.upload.native_usb=true
PMM0625.build.mcu=cortex-m0plus
PMM0625.build.f_cpu=48000000L
PMM0625.build.usb_product="pmm0625"
PMM0625.build.usb_manufacturer="PMM LLC"
PMM0625.build.board=pmm0625
PMM0625.build.core=arduino
PMM0625.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0625.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0625.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0625.build.variant=pmm0625
PMM0625.build.variant_system_lib=
PMM0625.build.vid=0x2341
PMM0625.build.pid=0x804d
PMM0625.bootloader.tool=openocd
PMM0625.bootloader.tool.default=openocd
PMM0625.bootloader.file=zero/samd21_sam_ba.bin

# PMM0626 (Native USB Port)
# --------------------------------------
PMM0626.name=PMM0626 (Native USB Port)
PMM0626.vid.0=0x2341
PMM0626.pid.0=0x804d
PMM0626.vid.1=0x2341
PMM0626.pid.1=0x004d
PMM0626.vid.2=0x2341
PMM0626.pid.2=0x824d
PMM0626.vid.3=0x2341
PMM0626.pid.3=0x024d
PMM0626.upload_port.0.vid=0x2341
PMM0626.upload_port.0.pid=0x804d
PMM0626.upload_port.1.vid=0x2341
PMM0626.upload_port.1.pid=0x004d
PMM0626.upload_port.2.vid=0x2341
PMM0626.upload_port.2.pid=0x824d
PMM0626.upload_port.3.vid=0x2341
PMM0626.upload_port.3.pid=0x024d
PMM0626.upload_port.4.board=arduino_zero_native
PMM0626.build.usb_product="PMM0626"
PMM0626.upload.tool=bossac
PMM0626.upload.tool.default=bossac
PMM0626.upload.tool.network=arduino_ota
PMM0626.upload.protocol=sam-ba
PMM0626.upload.maximum_size=262144
PMM0626.upload.maximum_data_size=32768
PMM0626.upload.use_1200bps_touch=true
PMM0626.upload.wait_for_upload_port=true
PMM0626.upload.native_usb=true
PMM0626.build.mcu=cortex-m0plus
PMM0626.build.f_cpu=48000000L
PMM0626.build.usb_product="pmm0626"
PMM0626.build.usb_manufacturer="PMM LLC"
PMM0626.build.board=pmm0626
PMM0626.build.core=arduino
PMM0626.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0626.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0626.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0626.build.variant=pmm0626
PMM0626.build.variant_system_lib=
PMM0626.build.vid=0x2341
PMM0626.build.pid=0x804d
PMM0626.bootloader.tool=openocd
PMM0626.bootloader.tool.default=openocd
PMM0626.bootloader.file=zero/samd21_sam_ba.bin





